In [173]:
import pandas as pd
import numpy as np

In [174]:
from io import BytesIO

In [175]:
import pyarrow.parquet as pa

In [176]:
table = pa.read_table('test_series.parquet') 
table

pyarrow.Table
series_id: large_string
step: uint32
timestamp: large_string
anglez: float
enmo: float
----
series_id: [["038441c925bb","038441c925bb","038441c925bb","038441c925bb","038441c925bb",...,"0402a003dae9","0402a003dae9","0402a003dae9","0402a003dae9","0402a003dae9"]]
step: [[0,1,2,3,4,...,145,146,147,148,149]]
timestamp: [["2018-08-14T15:30:00-0400","2018-08-14T15:30:05-0400","2018-08-14T15:30:10-0400","2018-08-14T15:30:15-0400","2018-08-14T15:30:20-0400",...,"2018-12-18T12:57:05-0500","2018-12-18T12:57:10-0500","2018-12-18T12:57:15-0500","2018-12-18T12:57:20-0500","2018-12-18T12:57:25-0500"]]
anglez: [[2.6367,2.6368,2.637,2.6368,2.6368,...,-59.6969,-35.6566,-21.5824,-42.616,7.0299]]
enmo: [[0.0217,0.0215,0.0216,0.0213,0.0215,...,0.0601,0.0427,0.0309,0.0328,0.0081]]

In [177]:
table.shape

(450, 5)

In [178]:

df = table.to_pandas() 
# Taking tanspose so the printing dataset will easy. 
df.head().T

,0,1,2,3,4
series_id,038441c925bb,038441c925bb,038441c925bb,038441c925bb,038441c925bb
step,0,1,2,3,4
timestamp,2018-08-14T15:30:00-0400,2018-08-14T15:30:05-0400,2018-08-14T15:30:10-0400,2018-08-14T15:30:15-0400,2018-08-14T15:30:20-0400
anglez,2.6367,2.6368,2.637,2.6368,2.6368
enmo,0.0217,0.0215,0.0216,0.0213,0.0215

In [179]:
df = pd.read_parquet('test_series.parquet') 
df.head()

      series_id  step                 timestamp  anglez    enmo
0  038441c925bb     0  2018-08-14T15:30:00-0400  2.6367  0.0217
1  038441c925bb     1  2018-08-14T15:30:05-0400  2.6368  0.0215
2  038441c925bb     2  2018-08-14T15:30:10-0400  2.6370  0.0216
3  038441c925bb     3  2018-08-14T15:30:15-0400  2.6368  0.0213
4  038441c925bb     4  2018-08-14T15:30:20-0400  2.6368  0.0215

In [180]:
df.describe()

           step      anglez        enmo
count  450.0000  450.000000  450.000000
mean    74.5000  -56.177723    0.030276
std     43.3485   39.331936    0.067950
min      0.0000  -88.367996    0.000000
25%     37.0000  -88.216599    0.000000
50%     74.5000  -79.989449    0.013300
75%    112.0000  -29.100624    0.035250
max    149.0000   68.460503    0.980200

In [181]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 450 entries, 0 to 449
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   series_id  450 non-null    object
 1   step       450 non-null    uint32
 2   timestamp  450 non-null    object
 3   anglez     450 non-null    float32
 4   enmo       450 non-null    float32
dtypes: float32(2), object(2), uint32(1)
memory usage: 12.4+ KB

In [182]:
df['date']=df['timestamp'].str.split('T', expand=True)[0]
df['time']=df['timestamp'].str.split('T', expand=True)[1]
df['time']=df['time'].str.split('-', expand=True)[0]
df.drop('timestamp',inplace=True,axis=1)

In [183]:
df.head()

      series_id  step  anglez    enmo        date      time
0  038441c925bb     0  2.6367  0.0217  2018-08-14  15:30:00
1  038441c925bb     1  2.6368  0.0215  2018-08-14  15:30:05
2  038441c925bb     2  2.6370  0.0216  2018-08-14  15:30:10
3  038441c925bb     3  2.6368  0.0213  2018-08-14  15:30:15
4  038441c925bb     4  2.6368  0.0215  2018-08-14  15:30:20

In [184]:
df['date']=pd.to_datetime(df['date'])
df['time'] = pd.to_datetime(df['time'], format="%H:%M:%S")

In [185]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 450 entries, 0 to 449
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   series_id  450 non-null    object
 1   step       450 non-null    uint32
 2   anglez     450 non-null    float32
 3   enmo       450 non-null    float32
 4   date       450 non-null    datetime64[ns]
 5   time       450 non-null    datetime64[ns]
dtypes: datetime64[ns](2), float32(2), object(1), uint32(1)
memory usage: 15.9+ KB